n5/src/InformationRegisters/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Membership</name>
  <dimensions>
    <name>Membership</name>
    <comment>Do not use name &quot;Group&quot;</comment>
    <type>
      <types>CatalogRef.Membership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Enums/RemoteActions/RemoteActions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RemoteActions</name>
  <enumValues>
    <name>ChangesAllow</name>
  </enumValues>
  <enumValues>
    <name>ChangesDeny</name>
  </enumValues>
  <enumValues>
    <name>MeetingMaybe</name>
  </enumValues>
  <enumValues>
    <name>MeetingNo</name>
  </enumValues>
  <enumValues>
    <name>MeetingYes</name>
  </enumValues>
  <enumValues>
    <name>PermissionAllow</name>
  </enumValues>
  <enumValues>
    <name>PermissionDeny</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/AllowDeny/AllowDeny.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AllowDeny</name>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Deny</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Catalogs/Membership/Membership.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Membership</name>
  <predefined>
    <items>
      <name>Users</name>
      <description>Users</description>
    </items>
  </predefined>
  <attributes>
    <name>TenantAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Tenants</name>
    <attributes>
      <name>Tenant</name>
      <type>
        <types>CatalogRef.Tenants</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/CommonModules/SalesPermissionMailing/Module.bsl
Procedure Send ( Document, Reason ) export
	
 	profile = MailboxesSrv.SystemProfile ();
	for each receiver in getReceivers () do
		message = createMessage ( Document, Reason, receiver );
		try
			MailboxesSrv.Post ( profile, message );
		except
			WriteLogEvent ( "MailboxesSrv.Post", EventLogLevel.Error, , Document, ErrorDescription () );
		endtry
	enddo;
	
EndProcedure

Function createMessage ( Document, Reason, Receiver )
	
	message = new InternetMailMessage ();
	message.From = Cloud.Noreply ();
	message.To.Add ( Receiver.Email );
	info = new Structure ( "User, Receiver, Document, Customer, Reason, Yes, No, Amount" );
	info.User = TrimAll ( "" + SessionParameters.User );
	data = DF.Values ( Document, "Document as Source, Document.Amount as Amount, Document.Currency.Description as Currency, Customer.Description as Customer" );
	info.Customer = data.Customer;
	info.Amount = Conversion.NumberToMoney ( data.Amount, data.Currency );
	info.Reason = Reason;
	login = TrimAll ( Receiver.Login );
	info.Receiver = login;
	info.Document = "" + data.Source;
	responsible = Receiver.Ref;
	actions = InformationRegisters.RemoteActions;
	info.Yes = actions.Create ( Enums.RemoteActions.PermissionAllow, Document, responsible );
	info.No = actions.Create ( Enums.RemoteActions.PermissionDeny, Document, responsible );
	message.Subject = Output.SalesRequestSubject ( info );
	body = Output.SalesRequestBody ( info );
	message.Texts.Add ( body, InternetMailTextType.HTML );
	return message;

EndFunction

Function getReceivers ()
	
	access = """" + Metadata.Roles.ApproveSales.Name + """";
	s = "
	|select min ( Users.Ref ) as Ref, min ( Users.Code ) as Login, Users.Email as Email
	|from Catalog.Users as Users
	|where not Users.DeletionMark
	|and not Users.AccessDenied
	|and not Users.AccessRevoked               
	|and Users.Ref in (
	|	select Rights.Ref as User
	|	from Catalog.Users.Rights as Rights
	|	where Rights.RoleName = " + access + "
	|	union
	|	select Memberships.User
	|	from InformationRegister.Membership as Memberships
	|	//
	|	// Group Rights
	|	//
	|	join Catalog.Membership.Rights as GroupRights
	|	on GroupRights.Ref = Memberships.Membership
	|	and GroupRights.RoleName = " + access + "
	|)
	|group by Users.Email
	|";
	q = new Query ( s );
	return q.Execute ().Unload ();
	
EndFunction

Procedure NotifyUser ( Params ) export
	
	creator = Params.Creator;
	receiver = DF.Pick ( creator, "Email" );
	if ( IsBlankString ( receiver ) ) then
		return;
	endif;
	info = new Structure ( "Creator, Document, Resolution, Responsible, Customer" );
	FillPropertyValues ( info, Params );
	info.Responsible = TrimAll ( Params.Responsible );
	info.Creator = TrimAll ( Params.Creator );
	document = Params.Document;
	info.Customer = DF.Pick ( document, "Customer.Description" );
	profile = MailboxesSrv.SystemProfile ();
	message = new InternetMailMessage ();
	message.From = Cloud.Noreply ();
	message.To.Add ( receiver );
	if ( Params.Resolution = Enums.AllowDeny.Allow ) then
		message.Subject = Output.SalesNotifyUserSubject1 ( info );
		body = Output.SalesNotifyUserBody1 ( info );
	else
		message.Subject = Output.SalesNotifyUserSubject2 ( info );
		body = Output.SalesNotifyUserBody2 ( info );
	endif;
	message.Texts.Add ( body, InternetMailTextType.HTML );
	try
		MailboxesSrv.Post ( profile, message );
	except
		WriteLogEvent ( "MailboxesSrv.Post", EventLogLevel.Error, , document,
			ErrorDescription () );
	endtry
	
EndProcedure
